[
{
"authors":"T-H. Hubert Chan and Jonathan Katz and Kartik Nayak and Antigoni Polychroniadou and Elaine Shi",
"id":"2018/851",
"title":"More is Less: Perfectly Secure Oblivious Algorithms in the Multi-Server Setting"
},
{
"authors":"Carmit Hazay and Emmanuela Orsini and Peter Scholl and Eduardo Soria-Vazquez",
"id":"2018/843",
"title":"Concretely Efficient Large-Scale MPC with Active Security (or, TinyKeys for TinyOT)"
},
{
"authors":"Sébastien Canard and David Pointcheval and Quentin Santos and Jacques Traoré",
"id":"2018/827",
"title":"Practical Strategy-Resistant Privacy-Preserving Elections"
},
{
"authors":"Deevashwer Rathee and Pradeep Kumar Mishra and Masaya Yasuda",
"id":"2018/801",
"title":"Faster PCA and Linear Regression through Hypercubes in HElib"
},
{
"authors":"Louis Goubin and Francisco Vial-Prado",
"id":"2018/794",
"title":"Blending FHE-NTRU keys – The Excalibur Property"
},
{
"authors":"Vladimir Kolesnikov",
"id":"2018/789",
"title":"Free IF: How to Omit Inactive Branches and Implement S-Universal Garbled Circuit (Almost) for Free"
},
{
"authors":"Hao Chen and Zhicong Huang and Kim Laine and Peter Rindal",
"id":"2018/787",
"title":"Labeled PSI from Fully Homomorphic Encryption with Malicious Security"
},
{
"authors":"Carl Bootland and Wouter Castryck and Ilia Iliashenko and Frederik Vercauteren",
"id":"2018/785",
"title":"Efficiently Processing Complex-Valued Data in Homomorphic Encryption"
},
{
"authors":"Itai Dinur",
"id":"2018/772",
"title":"Linear Equivalence of Block Ciphers with Partial Non-Linear Layers: Application to LowMC"
},
{
"authors":"Toshinori Araki and Assi Barak and Jun Furukawa and Marcel Keller and Yehuda Lindell and Kazuma Ohara and Hikaru Tsuchida",
"id":"2018/762",
"title":"Generalizing the SPDZ Compiler For Other Protocols"
},
{
"authors":"Prabhanjan Ananth and Alex Lombardi",
"id":"2018/759",
"title":"Succinct Garbling Schemes from Functional Encryption through a Local Simulation Paradigm"
},
{
"authors":"Christina Boura and Nicolas Gama and Mariya Georgieva",
"id":"2018/758",
"title":"Chimera: a unified framework for B/FV, TFHE and HEAAN fully homomorphic encryption and predictions for deep learning"
},
{
"authors":"Assi Barak and Martin Hirt and Lior Koskas and Yehuda Lindell",
"id":"2018/751",
"title":"An End-to-End System for Large Scale P2P MPC-as-a-Service and Low-Bandwidth MPC for Weak Participants"
},
{
"authors":"Leon J. Helsloot and Gamze Tillem and Zekeriya Erkin",
"id":"2018/744",
"title":"BAdASS: Preserving Privacy in Behavioural Advertising with Applied Secret Sharing"
},
{
"authors":"Aurélien Dupin and David Pointcheval and Christophe Bidan",
"id":"2018/743",
"title":"On the Leakage of Corrupted Garbled Circuits"
},
{
"authors":"Marina Blanton and Myoungin Jeong",
"id":"2018/736",
"title":"Improved Signature Schemes for Secure Multi-Party Computation with Certified Inputs"
},
{
"authors":"Lijing Zhou and Licheng Wang and Yiru Sun and Tianyi Ai",
"id":"2018/735",
"title":"BeeHive: Double Non-interactive Secure Multi-party Computation"
},
{
"authors":"Stanislaw Jarecki and Hugo Krawczyk and Jason Resch",
"id":"2018/733",
"title":"Threshold Partially-Oblivious PRFs with Applications to Key Management"
},
{
"authors":"Avradip Mandal and John C. Mitchell and Hart Montgomery and Arnab Roy",
"id":"2018/732",
"title":"Data Oblivious Genome Variants Search on Intel SGX"
},
{
"authors":"Itai Dinur and Nathan Keller and Ohad Klein",
"id":"2018/731",
"title":"An Optimal Distributed Discrete Log Protocol with Applications to Homomorphic Secret Sharing"
},
{
"authors":"Shashank Agrawal and Payman Mohassel and Pratyay Mukherjee and Peter Rindal",
"id":"2018/727",
"title":"DiSE: Distributed Symmetric-key Encryption"
},
{
"authors":"Megha Byali and Arun Joseph and Arpita Patra and Divya Ravi",
"id":"2018/710",
"title":"Fast Secure Computation for Small Population over the Internet"
},
{
"authors":"Elette Boyle and Niv Gilboa and Yuval Ishai",
"id":"2018/707",
"title":"Function Secret Sharing: Improvements and Extensions"
},
{
"authors":"Paul Bunn and Jonathan Katz and Eyal Kushilevitz and Rafail Ostrovsky",
"id":"2018/706",
"title":"Efficient 3-Party Distributed ORAM"
},
{
"authors":"Niek J. Bouman and Niels de Vreede",
"id":"2018/703",
"title":"New Protocols for Secure Linear Algebra: Pivoting-Free Elimination and Fast Block-Recursive Matrix Decomposition"
},
{
"authors":"Jonathan Frankle and Sunoo Park and Daniel Shaar and Shafi Goldwasser and Daniel J. Weitzner",
"id":"2018/697",
"title":"Practical Accountability of Secret Processes"
},
{
"authors":"Kimmo Järvinen and Ágnes Kiss and Thomas Schneider and Oleksandr Tkachenko and Zheng Yang",
"id":"2018/694",
"title":"Faster Privacy-Preserving Location Proximity Schemes"
},
{
"authors":"Jia-Si Weng and Jian Weng and Ming Li and Yue Zhang and Weiqi Luo",
"id":"2018/679",
"title":"DeepChain: Auditable and Privacy-Preserving Deep Learning with Blockchain-based Incentive"
},
{
"authors":"Pradeep Kumar Mishra and Deevashwer Rathee and Dung Hoang Duong and Masaya Yasuda",
"id":"2018/663",
"title":"Fast Secure Matrix Multiplications over Ring-Based Homomorphic Encryption"
},
{
"authors":"Kyoohyung Han and Seungwan Hong and Jung Hee Cheon and Daejun Park",
"id":"2018/662",
"title":"Efficient Logistic Regression on Large Encrypted Data"
},
{
"authors":"Pierre-Alain Fouque and Benjamin Hadjibeyli and Paul Kirchner",
"id":"2018/653",
"title":"Homomorphic Evaluation of Lattice-Based Symmetric Encryption Schemes"
},
{
"authors":"Lucas Schabhüser and Denis Butin and Denise Demirel and Johanens Buchmann",
"id":"2018/639",
"title":"Function-Dependent Commitments for Verifiable Multi-Party Computation"
},
{
"authors":"Shuhong Gao",
"id":"2018/637",
"title":"Efficient Fully Homomorphic Encryption Scheme"
},
{
"authors":"Sergiu Carpov and Oana Stan",
"id":"2018/626",
"title":"Efficient Evaluation of Low Degree Multivariate Polynomials in Ring-LWE Homomorphic Encryption Schemes"
},
{
"authors":"Sergiu Carpov and Malika Izabachène and Victor Mollimard",
"id":"2018/622",
"title":"New techniques for multi-value homomorphic evaluation and applications"
},
{
"authors":"Mor Weiss and Daniel Wichs",
"id":"2018/619",
"title":"Is there an Oblivious RAM Lower Bound for Online Reads?"
},
{
"authors":"Ahmad Al Badawi and Yuriy Polyakov and Khin Mi Mi Aung and Bharadwaj Veeravalli and Kurt Rohloff",
"id":"2018/589",
"title":"Implementation and Performance Evaluation of RNS Variants of the BFV Homomorphic Encryption Scheme"
},
{
"authors":"Mugurel Barcau and Vicentiu Pasol",
"id":"2018/584",
"title":"Bounded Fully Homomorphic Encryption from Monoid Algebras"
},
{
"authors":"Mugurel Barcau and Vicentiu Pasol",
"id":"2018/583",
"title":"Ring Homomorphic Encryption Schemes"
},
{
"authors":"Saikrishna Badrinarayanan and Aayush Jain and Nathan Manohar and Amit Sahai",
"id":"2018/580",
"title":"Secure MPC: Laziness Leads to GOD"
},
{
"authors":"Daniel Demmler and Peter Rindal and Mike Rosulek and Ni Trieu",
"id":"2018/579",
"title":"PIR-PSI: Scaling Private Contact Discovery"
},
{
"authors":"Jonathan Katz and Samuel Ranellucci and Mike Rosulek and Xiao Wang",
"id":"2018/578",
"title":"Optimizing Authenticated Garbling for Faster Secure Two-Party Computation"
},
{
"authors":"Tore Kasper Frederiksen and Yehuda Lindell and Valery Osheter and Benny Pinkas",
"id":"2018/577",
"title":"Fast Distributed RSA Key Generation for Semi-Honest and Malicious Adversaries"
},
{
"authors":"Prabhanjan Ananth and Arka Rai Choudhuri and Aarushi Goel and Abhishek Jain",
"id":"2018/572",
"title":"Round-Optimal Secure Multiparty Computation with Honest Majority"
},
{
"authors":"Elette Boyle and Yuval Ishai and Antigoni Polychroniadou",
"id":"2018/571",
"title":"Limits of Practical Sublinear Secure Computation"
},
{
"authors":"Koji Chida and Daniel Genkin and Koki Hamada and Dai Ikarashi and Ryo Kikuchi and Yehuda Lindell and Ariel Nof",
"id":"2018/570",
"title":"Fast Large-Scale Honest-Majority MPC for Malicious Adversaries"
},
{
"authors":"Jung Hee Cheon and Andrey Kim",
"id":"2018/565",
"title":"Homomorphic Encryption for Approximate Matrix Arithmetic"
},
{
"authors":"Sanjam Garg and Rafail Ostrovsky and Akshayaram Srinivasan",
"id":"2018/549",
"title":"Adaptive Garbled RAM from Laconic Oblivious Transfer"
},
{
"authors":"Elette Boyle and Ran Cohen and Deepesh Data and Pavel Hubacek",
"id":"2018/540",
"title":"Must the Communication Graph of MPC Protocols be an Expander?"
},
{
"authors":"Daniele Micciancio and Jessica Sorrell",
"id":"2018/532",
"title":"Ring packing and amortized FHEW bootstrapping"
},
{
"authors":"Aurélien Dupin and Jean-Marc Robert and Christophe Bidan",
"id":"2018/525",
"title":"Location-Proof System based on Secure Multi-Party Computations"
},
{
"authors":"Osman Bicer and Muhammed Ali Bingol and Mehmet Sabir Kiraz",
"id":"2018/515",
"title":"Highly Efficient and Reusable Private Function Evaluation with Linear Complexity"
},
{
"authors":"Ran Gelles and Anat Paskin-Cherniavsky and Vassilis Zikas",
"id":"2018/506",
"title":"Secure Two-Party Computation over Unreliable Channels"
},
{
"authors":"Helene Haagh and Aleksandr Karbyshev and Sabine Oechsner and Bas Spitters and Pierre-Yves Strub",
"id":"2018/502",
"title":"Computer-aided proofs for multiparty computation with active security"
},
{
"authors":"Jack Doerner and Yashvanth Kondi and Eysa Lee and abhi shelat",
"id":"2018/499",
"title":"Secure Two-party Threshold ECDSA from ECDSA Assumptions"
},
{
"authors":"Aydin Abadi and Sotirios Terzis and Roberto Metere and Changyu Dong",
"id":"2018/496",
"title":"Efficient Delegated Private Set Intersection on Outsourced Private Datasets"
},
{
"authors":"Changyu Dong and Grigorios Loukides",
"id":"2018/495",
"title":"Approximating Private Set Union/Intersection Cardinality with Logarithmic Complexity"
},
{
"authors":"Ghada Dessouky and Farinaz Koushanfar and Ahmad-Reza Sadeghi and Thomas Schneider and Shaza Zeitouni and Michael Zohner",
"id":"2018/486",
"title":"Pushing the Communication Barrier in Secure Computation using Lookup Tables"
},
{
"authors":"Ronald Cramer and Ivan Damgård and Daniel Escudero and Peter Scholl and Chaoping Xing",
"id":"2018/482",
"title":"SPDZ2k: Efficient MPC mod 2^k for Dishonest Majority"
},
{
"authors":"Arpita Patra and Divya Ravi",
"id":"2018/481",
"title":"On the Exact Round Complexity of Secure Three-Party Computation"
},
{
"authors":"Peter Sebastian Nordholt and Meilof Veeningen",
"id":"2018/474",
"title":"Minimising Communication in Honest-Majority MPC by Batchwise Multiplication Verification"
},
{
"authors":"Daniele Friolo and Daniel Masny and Daniele Venturi",
"id":"2018/473",
"title":"Secure Multi-Party Computation from Strongly Uniform Key Agreement"
},
{
"authors":"Anrin Chakraborti and Adam J. Aviv and Seung Geol Choi and Travis Mayberry and Daniel S. Roche and Radu Sion",
"id":"2018/471",
"title":"Efficient Range ORAM with $\\mathbb{O}(\\log^{2}{N})$ Locality"
},
{
"authors":"Thomas Agrikola and Geoffroy Couteau and Dennis Hofheinz",
"id":"2018/470",
"title":"The Usefulness of Sparsifiable Inputs: How to Avoid Subexponential iO"
},
{
"authors":"Nigel P. Smart and Tim Wood",
"id":"2018/467",
"title":"Error-Detecting in Monotone Span Programs with Application to Communication Efficient Multi-Party Computation"
},
{
"authors":"Geoffroy Couteau",
"id":"2018/465",
"title":"A Note on the Communication Complexity of Multiparty Computation in the Correlated Randomness Model"
},
{
"authors":"Hao Chen and Ran Gilad-Bachrach and Kyoohyung Han and Zhicong Huang and Amir Jalali and Kim Laine and Kristin Lauter",
"id":"2018/462",
"title":"Logistic regression over encrypted data from fully homomorphic encryption"
},
{
"authors":"Prabhanjan Ananth and Saikrishna Badrinarayanan and Aayush Jain and Nathan Manohar and Amit Sahai",
"id":"2018/457",
"title":"From FE Combiners to Secure MPC and Back"
},
{
"authors":"David W. Archer and Dan Bogdanov and Y. Lindell and Liina Kamm and Kurt Nielsen and Jakob Illeborg Pagter and Nigel P. Smart and Rebecca N. Wright",
"id":"2018/450",
"title":"From Keys to Databases -- Real-World Applications of Secure Multi-Party Computation"
},
{
"authors":"Bing Zeng",
"id":"2018/444",
"title":"Founding Cryptography on Smooth Projective Hashing"
},
{
"authors":"Rishab Goyal",
"id":"2018/443",
"title":"Quantum Multi-Key Homomorphic Encryption for Polynomial-Sized Circuits"
},
{
"authors":"Sameer Wagh and Divya Gupta and Nishanth Chandran",
"id":"2018/442",
"title":"SecureNN: Efficient and Private Neural Network Training"
},
{
"authors":"Ignacio Cascudo and Ronald Cramer and Chaoping Xing and Chen Yuan",
"id":"2018/429",
"title":"Amortized Complexity of Information-Theoretically Secure MPC Revisited"
},
{
"authors":"Kasper Green Larsen and Jesper Buus Nielsen",
"id":"2018/423",
"title":"Yes, There is an Oblivious RAM Lower Bound!"
},
{
"authors":"Ilaria Chillotti and Nicolas Gama and Mariya Georgieva and Malika Izabachène",
"id":"2018/421",
"title":"TFHE: Fast Fully Homomorphic Encryption over the Torus"
},
{
"authors":"Elette Boyle and Geoffroy Couteau and Niv Gilboa and Yuval Ishai and Michele Orrù",
"id":"2018/419",
"title":"Homomorphic Secret Sharing: Optimizations and Applications"
},
{
"authors":"Angela Jäschke and Frederik Armknecht",
"id":"2018/411",
"title":"Unsupervised Machine Learning on Encrypted Data"
},
{
"authors":"Willy Quach and Hoeteck Wee and Daniel Wichs",
"id":"2018/409",
"title":"Laconic Function Evaluation and Applications"
},
{
"authors":"José Bacelar Almeida and Manuel Barbosa and Gilles Barthe and Hugo Pacheco and Vitor Pereira and Bernardo Portela",
"id":"2018/404",
"title":"Enforcing ideal-world leakage bounds in real-world secret sharing MPC frameworks"
},
{
"authors":"Payman Mohassel and Peter Rindal",
"id":"2018/403",
"title":"ABY3: A Mixed Protocol Framework for Machine Learning"
},
{
"authors":"Alexander R. Block and Hemanta K. Maji and Hai H. Nguyen",
"id":"2018/395",
"title":"Embedding Multiplications at a Linear Rate and its Applications"
},
{
"authors":"Ryo Kikuchi and Dai Ikarashi and Takahiro Matsuda and Koki Hamada and Koji Chida",
"id":"2018/387",
"title":"Efficient Bit-Decomposition and Modulus-Conversion Protocols with an Honest Majority"
},
{
"authors":"Sarvar Patel and Giuseppe Persiano and Mariana Raykova and Kevin Yeo",
"id":"2018/373",
"title":"PanORAMa: Oblivious RAM with Logarithmic Overhead"
},
{
"authors":"Alexander R. Block and Divya Gupta and Hemanta K. Maji and Hai H. Nguyen",
"id":"2018/372",
"title":"Secure Computation using Leaky Correlations (Asymptotically Optimal Constructions)"
},
{
"authors":"T-H. Hubert Chan and Kartik Nayak and Elaine Shi",
"id":"2018/364",
"title":"Perfectly Secure Oblivious Parallel RAM"
},
{
"authors":"Ariel Hamlin and Rafail Ostrovsky and Mor Weiss and Daniel Wichs",
"id":"2018/363",
"title":"Private Anonymous Data Access"
},
{
"authors":"Christina-Angeliki Toli and Abdelrahaman Aly and Bart Preneel",
"id":"2018/359",
"title":"Privacy-Preserving Multibiometric Authentication in Cloud with Untrusted Database Providers"
},
{
"authors":"Stanislaw Jarecki and Boyang Wei",
"id":"2018/347",
"title":"3PC ORAM with Low Latency, Low Bandwidth, and Fast Batch Retrieval"
},
{
"authors":"Andrea Cerulli and Emiliano De Cristofaro and Claudio Soriente",
"id":"2018/344",
"title":"Nothing Refreshes Like a RePSI: Reactive Private Set Intersection"
},
{
"authors":"Zvika Brakerski",
"id":"2018/338",
"title":"Quantum FHE (Almost) As Secure as Classical"
},
{
"authors":"Sanaz Taheri Boshrooyeh and Alptekin Küpçü and Öznur Özkasap",
"id":"2018/323",
"title":"PPAD: Privacy Preserving Group-Based ADvertising in Online Social Networks"
},
{
"authors":"Sergiu Carpov and Thibaud Tortech",
"id":"2018/314",
"title":"Secure top most significant genome variants search: iDASH 2017 competition"
},
{
"authors":"Anat Paskin-Cherniavsky",
"id":"2018/308",
"title":"On Perfectly Secure 2PC in the OT-hybrid model"
},
{
"authors":"Pascal Mainini and Rolf Haenni",
"id":"2018/300",
"title":"Outsourcing Modular Exponentiation in Cryptographic Web Applications"
},
{
"authors":"Matteo Campanelli and Rosario Gennaro",
"id":"2018/297",
"title":"Fine-Grained Secure Computation"
},
{
"authors":"Phillipp Schoppmann and Adrià Gascón and Borja Balle",
"id":"2018/289",
"title":"Private Nearest Neighbors Classification in Federated Databases"
},
{
"authors":"Gizem S. Çetin and Berk Sunar",
"id":"2018/283",
"title":"Homomorphic Rank Sort Using Surrogate Polynomials"
},
{
"authors":"Michael Raskin and Mark Simkin",
"id":"2018/268",
"title":"Oblivious RAM with Small Storage Overhead"
},
{
"authors":"Andrey Kim and Yongsoo Song and Miran Kim and Keewoo Lee and Jung Hee Cheon",
"id":"2018/254",
"title":"Logistic Regression Model Training based on the Approximate Homomorphic Encryption"
},
{
"authors":"Xiong Fan and Qiang Tang",
"id":"2018/250",
"title":"Making Public Key Functional Encryption Function Private, Distributively"
},
{
"authors":"Shai Halevi and Victor Shoup",
"id":"2018/244",
"title":"Faster Homomorphic Linear Transformations in HElib"
},
{
"authors":"Brett Hemenway Falk and Daniel Noble and Rafail Ostrovsky",
"id":"2018/238",
"title":"Private Set Intersection with Linear Communication from General Assumptions"
},
{
"authors":"Hagen Sparka and Florian Tschorsch and Björn Scheuermann",
"id":"2018/234",
"title":"P2KMV: A Privacy-preserving Counting Sketch for Efficient and Accurate Set Intersection Cardinality Estimations"
},
{
"authors":"Charlotte Bonte and Frederik Vercauteren",
"id":"2018/233",
"title":"Privacy-Preserving Logistic Regression Training"
},
{
"authors":"Masahiro Yagisawa",
"id":"2018/232",
"title":"Improved fully homomorphic public-key encryption with small ciphertext size"
},
{
"authors":"Wei-Kai Lin and Elaine Shi and Tiancheng Xie",
"id":"2018/227",
"title":"Can We Overcome the $n \\log n$ Barrier for Oblivious Sorting?"
},
{
"authors":"Shruti Tople and Yaoqi Jia and Prateek Saxena",
"id":"2018/220",
"title":"PRO-ORAM: Constant Latency Read-Only Oblivious RAM"
},
{
"authors":"S. Dov Gordon and Samuel Ranellucci and Xiao Wang",
"id":"2018/216",
"title":"Secure Computation with Low Communication from Cross-checking"
},
{
"authors":"Carmit Hazay and Emmanuela Orsini and Peter Scholl and Eduardo Soria-Vazquez",
"id":"2018/208",
"title":"Efficient MPC from Syndrome Decoding (or: Honey, I Shrunk the Keys)"
},
{
"authors":"Edouard Dufour Sans and Romain Gay and David Pointcheval",
"id":"2018/206",
"title":"Reading in the Dark: Classifying Encrypted Digits with Functional Encryption"
},
{
"authors":"Jack L.H. Crawford and Craig Gentry and Shai Halevi and Daniel Platt and Victor Shoup",
"id":"2018/202",
"title":"Doing Real Work with FHE: The Case of Logistic Regression"
},
{
"authors":"Jim Basilakis and Bahman Javadi",
"id":"2018/201",
"title":"Efficient Parallel Binary Operations on Homomorphic Encrypted Real Numbers"
},
{
"authors":"Yongjun Zhao and Sherman S. M. Chow",
"id":"2018/184",
"title":"Can you find the one for me? Privacy-Preserving Matchmaking via Threshold PSI"
},
{
"authors":"Christoph Dobraunig and Maria Eichlseder and Lorenzo Grassi and Virginie Lallemand and Gregor Leander and Eik List and Florian Mendel and Christian Rechberger",
"id":"2018/181",
"title":"Rasta: A cipher with low ANDdepth and few ANDs per bit"
},
{
"authors":"Sanjam Garg and Peihan Miao and Akshayaram Srinivasan",
"id":"2018/180",
"title":"Two-Round Multiparty Secure Computation Minimizing Public Key Operations"
},
{
"authors":"Ken Goss and Wei Jiang",
"id":"2018/179",
"title":"Efficient and Constant-Rounds Secure Comparison through Dynamic Groups and Asymmetric Computations"
},
{
"authors":"Sanjam Garg and Susumu Kiyoshima and Omkant Pandey",
"id":"2018/156",
"title":"A New Approach to Black-Box Concurrent Secure Computation"
},
{
"authors":"Jung Hee Cheon and Kyoohyung Han and Andrey Kim and Miran Kim and Yongsoo Song",
"id":"2018/153",
"title":"Bootstrapping for Approximate Homomorphic Encryption"
},
{
"authors":"Sanjam Garg and Akshayaram Srinivasan",
"id":"2018/151",
"title":"Adaptively Secure Garbling with Near Optimal Online Complexity"
},
{
"authors":"Amos Beimel and Eyal Kushilevitz and Pnina Nissim",
"id":"2018/148",
"title":"The Complexity of Multiparty PSM Protocols and Related Models"
},
{
"authors":"Benny Applebaum and Thomas Holenstein and Manoj Mishra and Ofer Shayevitz",
"id":"2018/144",
"title":"The Communication Complexity of Private Simultaneous Messages, Revisited"
},
{
"authors":"Baiyu Li and Daniele Micciancio",
"id":"2018/141",
"title":"Symbolic security of garbled circuits"
},
{
"authors":"Wen-jie Lu and Jun Sakuma",
"id":"2018/139",
"title":"Faster Multiplication Triplet Generation from Homomorphic Encryption for Practical Privacy-Preserving Machine Learning under a Narrow Bandwidth"
},
{
"authors":"Benny Pinkas and Thomas Schneider and Christian Weinert and Udi Wieder",
"id":"2018/120",
"title":"Efficient Circuit-based PSI via Cuckoo Hashing"
},
{
"authors":"Shai Halevi and Yuriy Polyakov and Victor Shoup",
"id":"2018/117",
"title":"An Improved RNS Variant of the BFV Homomorphic Encryption Scheme"
},
{
"authors":"Michele Ciampi and Claudio Orlandi",
"id":"2018/105",
"title":"Combining Private Set-Intersection with Secure Two-Party Computation"
},
{
"authors":"Mustafa A. Mustafa and Sara Cleemput and Abdelrahaman Aly and Aysajan Abidin",
"id":"2018/101",
"title":"A Secure and Privacy-preserving Protocol for Smart Metering Operational Data Collection"
},
{
"authors":"Masahiro Yagisawa",
"id":"2018/088",
"title":"Fully homomorphic public-key encryption with small ciphertext size"
},
{
"authors":"Miran Kim and Yongsoo Song and Shuang Wang and Yuhou Xia and Xiaoqian Jiang",
"id":"2018/074",
"title":"Secure Logistic Regression based on Homomorphic Encryption"
},
{
"authors":"Chiraag Juvekar and Vinod Vaikuntanathan and Anantha Chandrakasan",
"id":"2018/073",
"title":"GAZELLE: A Low Latency Framework for Secure Neural Network Inference"
},
{
"authors":"Hao Chen and Kyoohyung Han",
"id":"2018/067",
"title":"Homomorphic Lower Digits Removal and Improved FHE Bootstrapping"
},
{
"authors":"Chaya Ganesh and Yashvanth Kondi and Arpita Patra and Pratik Sarkar",
"id":"2018/043",
"title":"Efficient Adaptively Secure Zero-knowledge from Garbled Circuits"
},
{
"authors":"Yuval Ishai and Manika Mittal and Rafail Ostrovsky",
"id":"2018/038",
"title":"On the Message Complexity of Secure Multiparty Computation"
},
{
"authors":"Peter Scholl",
"id":"2018/036",
"title":"Extending Oblivious Transfer with Low Communication via Key-Homomorphic PRFs"
},
{
"authors":"Martin Strand",
"id":"2018/027",
"title":"A verifiable shuffle for the GSW cryptosystem"
},
{
"authors":"Christopher Carr and Anamaria Costache and Gareth T. Davies and Kristian Gjøsteen and Martin Strand",
"id":"2018/026",
"title":"Zero-Knowledge Proof of Decryption for FHE Ciphertexts"
},
{
"authors":"Xiao Wang and Dov Gordon and Jonathan Katz",
"id":"2018/005",
"title":"Simple and Efficient Two-Server ORAM"
},
{
"authors":"Moni Naor and Benny Pinkas and Eyal Ronen",
"id":"2018/003",
"title":"How to (not) share a password: Privacy preserving protocols for finding heavy hitters with adversarial behavior"
},
{
"authors":"Cagdas Calik and Meltem Sonmez Turan and Rene Peralta",
"id":"2018/002",
"title":"The Multiplicative Complexity of 6-variable Boolean Functions"
},
{
"authors":"Elette Boyle and Niv Gilboa and Yuval Ishai and Huijia Lin and Stefano Tessaro",
"id":"2017/1248",
"title":"Foundations of Homomorphic Secret Sharing"
},
{
"authors":"Thang Hoang and Ceyhun D. Ozkaptan and Gabriel Hackebeil and Attila A. Yavuz",
"id":"2017/1238",
"title":"Efficient Oblivious Data Structures for Database Services on the Cloud"
},
{
"authors":"Christina Boura and Ilaria Chillotti and Nicolas Gama and Dimitar Jetchev and Stanislav Peceny and Alexander Petric",
"id":"2017/1234",
"title":"High-Precision Privacy-Preserving Real-Valued Function Evaluation"
},
{
"authors":"Marcel Keller and Valerio Pastro and Dragos Rotaru",
"id":"2017/1230",
"title":"Overdrive: Making SPDZ Great Again"
},
{
"authors":"Yehuda Lindell and Avishay Yanai",
"id":"2017/1225",
"title":"Fast Garbling of Circuits over 3-Valued Logic"
},
{
"authors":"Oana Stan and Mohamed-Haykel Zayani and Renaud Sirdey and Amira Ben Hamida and Alessandro Ferreira Leite and Mallek Mziou-Sallami",
"id":"2017/1212",
"title":"A New Crypto-Classifier Service for Energy Efficiency in Smart Cities"
},
{
"authors":"Eleftheria Makri and Dragos Rotaru and Nigel P. Smart and Frederik Vercauteren",
"id":"2017/1190",
"title":"PICS: Private Image Classification with SVM"
},
{
"authors":"Aner Ben-Efraim",
"id":"2017/1186",
"title":"On Multiparty Garbling of Arithmetic Circuits"
},
{
"authors":"Merav Parter and Eylon Yogev",
"id":"2017/1182",
"title":"Distributed Computing Made Secure: A New Cycle Cover Theorem"
},
{
"authors":"M. Sadegh Riazi and Christian Weinert and Oleksandr Tkachenko and Ebrahim M. Songhori and Thomas Schneider and Farinaz Koushanfar",
"id":"2017/1164",
"title":"Chameleon: A Hybrid Secure Computation Framework for Machine Learning Applications"
},
{
"authors":"Thang Hoang and Attila A. Yavuz and Betul F. Durak and Jorge Guajardo",
"id":"2017/1158",
"title":"Oblivious Dynamic Searchable Encryption via Distributed PIR and ORAM"
},
{
"authors":"Ebrahim M. Songhori and M. Sadegh Riazi and Siam U. Hussain and Ahmad-Reza Sadeghi and Farinaz Koushanfar",
"id":"2017/1157",
"title":"ARM2GC: Simple and Efficient Garbled Circuit Framework by Skipping"
},
{
"authors":"Sanjam Garg and Akshayaram Srinivasan",
"id":"2017/1156",
"title":"Two-Round Multiparty Secure Computation from Minimal Assumptions"
},
{
"authors":"Vladimir Kolesnikov and Mike Rosulek and Ni Trieu",
"id":"2017/1150",
"title":"SWiM: Secure Wildcard Pattern Matching From OT Extension"
},
{
"authors":"Sebastian Angel and Hao Chen and Kim Laine and Srinath Setty",
"id":"2017/1142",
"title":"PIR with compressed queries and amortized computation"
},
{
"authors":"Fabrice Benhamouda and Huijia Lin",
"id":"2017/1125",
"title":"k-Round MPC from k-Round OT via Garbled Interactive Circuits"
},
{
"authors":"Florian Bourse and Michele Minelli and Matthias Minihold and Pascal Paillier",
"id":"2017/1114",
"title":"Fast Homomorphic Evaluation of Deep Discretized Neural Networks"
},
{
"authors":"Nishanth Chandran and Divya Gupta and Aseem Rastogi and Rahul Sharma and Shardul Tripathi",
"id":"2017/1109",
"title":"EzPC: Programmable, Efficient, and Scalable Secure Two-Party Computation"
},
{
"authors":"Nishanth Chandran and Wutichai Chongchitmate and Rafail Ostrovsky and Ivan Visconti",
"id":"2017/1092",
"title":"Universally Composable Secure Two and Multi-party Computation in the Corruptible Tamper-Proof Hardware Token Model"
},
{
"authors":"Arka Rai Choudhuri and Matthew Green and Abhishek Jain and Gabriel Kaptchuk and Ian Miers",
"id":"2017/1091",
"title":"Fairness in an Unfair World: Fair Multiparty Computation from public Bulletin Boards"
},
{
"authors":"Saikrishna Badrinarayanan and Vipul Goyal and Abhishek Jain and Yael Tauman Kalai and Dakshita Khurana and Amit Sahai",
"id":"2017/1088",
"title":"Promise Zero Knowledge and its Applications to Round Optimal MPC"
},
{
"authors":"Satrajit Ghosh and Tobias Nilges",
"id":"2017/1064",
"title":"An Algebraic Approach to Maliciously Secure Private Set Intersection"
},
{
"authors":"Shai Halevi and Carmit Hazay and Antigoni Polychroniadou and Muthuramakrishnan Venkitasubramaniam",
"id":"2017/1056",
"title":"Round-Optimal Secure Multi-Party Computation"
},
{
"authors":"Sean Bowe and Ariel Gabizon and Ian Miers",
"id":"2017/1050",
"title":"Scalable Multi-party Computation for zk-SNARK Parameters in the Random Beacon Model"
},
{
"authors":"Ivan Damgård and Ji Luo and Sabine Oechsner and Peter Scholl and Mark Simkin",
"id":"2017/1041",
"title":"Compact Zero-Knowledge Proofs of Small Hamming Weight"
},
{
"authors":"T-H. Hubert Chan and Kai-Min Chung and Bruce Maggs and Elaine Shi",
"id":"2017/1033",
"title":"Foundations of Differentially Oblivious Algorithms"
},
{
"authors":"Giulia Traverso and Denise Demirel and Johannes Buchmann",
"id":"2017/1032",
"title":"Performing Computations on Hierarchically Shared Secrets"
},
{
"authors":"Sahar Mazloom and S. Dov Gordon",
"id":"2017/1016",
"title":"Differentially Private Access Patterns in Secure Computation"
},
{
"authors":"Wouter Castryck and Ilia Iliashenko and Frederik Vercauteren",
"id":"2017/1013",
"title":"Homomorphic SIMMD Operations: Single Instruction Much More Data"
},
{
"authors":"Ashish Choudhury and Arpita Patra and Divya Ravi",
"id":"2017/1006",
"title":"Round and Communication Efficient Unconditionally-secure MPC with $t < n/3$ in Partially Synchronous Network"
},
{
"authors":"Sanjam Garg and Akshayaram Srinivasan",
"id":"2017/1004",
"title":"Garbled Protocols and Two-Round MPC from Bilinear Maps"
},
{
"authors":"Varsha Dani and Valerie King and Mahnush Movahedi and Jared Saia and Mahdi Zamani",
"id":"2017/1003",
"title":"Secure Multi-Party Computation in Large Networks"
},
{
"authors":"Guillaume Bonnoron and Léo Ducas and Max Fillinger",
"id":"2017/996",
"title":"Large FHE gates from Tensored Homomorphic Accumulator"
},
{
"authors":"Marcel Keller and Avishay Yanai",
"id":"2017/981",
"title":"Efficient Maliciously Secure Multiparty Computation for RAM"
},
{
"authors":"Irene Giacomelli and Somesh Jha and Marc Joye and C. David Page and Kyonghwan Yoon",
"id":"2017/979",
"title":"Privacy-Preserving Ridge Regression over Distributed Data from LHE"
},
{
"authors":"Mike Rosulek",
"id":"2017/976",
"title":"Improvements for Gate-Hiding Garbled Circuits"
},
{
"authors":"Abdelrahaman Aly and Sara Cleemput",
"id":"2017/971",
"title":"An Improved Protocol for Securely Solving the Shortest Path Problem and its Application to Combinatorial Auctions"
},
{
"authors":"Sarvar Patel and Giuseppe Persiano and Kevin Yeo",
"id":"2017/964",
"title":"Recursive ORAMs with Practical Constructions"
},
{
"authors":"Nico Döttling and Nils Fleischhacker and Johannes Krupp and Dominique Schröder",
"id":"2017/958",
"title":"Two-Message, Oblivious Evaluation of Cryptographic Functionalities"
},
{
"authors":"Dan Boneh and Rosario Gennaro and Steven Goldfeder and Aayush Jain and Sam Kim and Peter M. R. Rasmussen and Amit Sahai",
"id":"2017/956",
"title":"Threshold Cryptosystems From Threshold Fully Homomorphic Encryption"
},
{
"authors":"Charlotte Bonte and Eleftheria Makri and Amin Ardeshirdavani and Jaak Simm and Yves Moreau and Frederik Vercauteren",
"id":"2017/955",
"title":"Privacy-Preserving Genome-Wide Association Study is Practical"
},
{
"authors":"Yehuda Lindell and Tal Rabin",
"id":"2017/952",
"title":"Secure Two-Party Computation with Fairness -- A Necessary Design Principle"
},
{
"authors":"Carmit Hazay and Yuval Ishai and Muthuramakrishnan Venkitasubramaniam",
"id":"2017/947",
"title":"Actively Secure Garbled Circuits with Constant Communication Overhead in the Plain Model"
},
{
"authors":"Prabhanjan Ananth and Abhishek Jain",
"id":"2017/942",
"title":"On Secure Two-Party Computation in Three Rounds"
},
{
"authors":"Zahra Jafargholi and Alessandra Scafuro and Daniel Wichs",
"id":"2017/934",
"title":"Adaptively Indistinguishable Garbled Circuits"
},
{
"authors":"T-H. Hubert Chan and Yue Guo and Wei-Kai Lin and Elaine Shi",
"id":"2017/924",
"title":"Oblivious Hashing Revisited, and Applications to Asymptotically Efficient ORAM and OPRAM"
},
{
"authors":"Long Chen and Zhenfeng Zhang and Xueqing Wang",
"id":"2017/923",
"title":"Batched Multi-hop Multi-key FHE from ring-LWE with Compact Ciphertext Extension"
},
{
"authors":"Michele Ciampi and Rafail Ostrovsky and Luisa Siniscalchi and Ivan Visconti",
"id":"2017/920",
"title":"Round-Optimal Secure Two-Party Computation from Trapdoor Permutations"
},
{
"authors":"T-H. Hubert Chan and Yue Guo and Wei-Kai Lin and Elaine Shi",
"id":"2017/914",
"title":"Cache-Oblivious and Data-Oblivious Sorting and Applications"
},
{
"authors":"Paul Laird",
"id":"2017/912",
"title":"On Two Round Rerunnable MPC Protocols"
},
{
"authors":"Ivan Damgård and Claudio Orlandi and Mark Simkin",
"id":"2017/908",
"title":"Yet Another Compiler for Active Security or: Efficient MPC Over Arbitrary Rings"
},
{
"authors":"Shruti Tople and Hung Dang and Prateek Saxena and Ee-Chien Chang",
"id":"2017/885",
"title":"PermuteRam: Optimizing Oblivious Computation for Efficiency"
},
{
"authors":"Shai Halevi and Yuval Ishai and Abhishek Jain and Ilan Komargodski and Amit Sahai and Eylon Yogev",
"id":"2017/871",
"title":"Non-Interactive Multiparty Computation without Correlated Randomness"
},
{
"authors":"Aner Ben-Efraim and Yehuda Lindell and Eran Omri",
"id":"2017/862",
"title":"Efficient Scalable Constant-Round MPC via Garbled Circuits"
},
{
"authors":"T-H. Hubert Chan and Kai-Min Chung and Elaine Shi",
"id":"2017/861",
"title":"On the Depth of Oblivious Parallel RAM"
},
{
"authors":"Jing Li and Licheng Wang",
"id":"2017/839",
"title":"Noiseless Fully Homomorphic Encryption"
},
{
"authors":"Jack Doerner and abhi shelat",
"id":"2017/827",
"title":"Scaling ORAM for Secure Computation"
},
{
"authors":"José Bacelar Almeida and Manuel Barbosa and Gilles Barthe and François Dupressoir and Benjamin Grégoire and Vincent Laporte and Vitor Pereira",
"id":"2017/821",
"title":"A Fast and Verified Software Stack for Secure Function Evaluation"
},
{
"authors":"Thang Hoang and Ceyhun D. Ozkaptan and Attila A. Yavuz and Jorge Guajardo and Tam Nguyen",
"id":"2017/819",
"title":"S3ORAM: A Computation-Efficient and Constant Client Bandwidth Blowup ORAM with Shamir Secret Sharing"
},
{
"authors":"Yehuda Lindell and Ariel Nof",
"id":"2017/816",
"title":"A Framework for Constructing Fast MPC over Arithmetic Circuits with Malicious Adversaries and an Honest-Majority"
},
{
"authors":"Hao Chen and Kim Laine and Rachel Player and Yuhou Xia",
"id":"2017/809",
"title":"High-Precision Arithmetic in Homomorphic Encryption"
},
{
"authors":"Vladimir Kolesnikov and Naor Matania and Benny Pinkas and Mike Rosulek and Ni Trieu",
"id":"2017/799",
"title":"Practical Multi-party Private Set Intersection from Symmetric-Key Techniques"
},
{
"authors":"Daniel Günther and Ágnes Kiss and Thomas Schneider",
"id":"2017/798",
"title":"More Efficient Universal Circuit Constructions"
},
{
"authors":"Nico D\u007föttling and Satrajit Ghosh and Jesper Buus Nielsen and Tobias Nilges and Roberto Tri filetti",
"id":"2017/790",
"title":"TinyOLE: Efficient Actively Secure Two-Party Computation from Oblivious Linear Function Evaluation"
},
{
"authors":"Nikolaos Alexopoulos and Aggelos Kiayias and Riivo Talviste and Thomas Zacharias",
"id":"2017/778",
"title":"MCMix: Anonymous Messaging via Secure Multiparty Computation"
},
{
"authors":"Gilad Asharov and T-H. Hubert Chan and Kartik Nayak and Rafael Pass and Ling Ren and Elaine Shi",
"id":"2017/772",
"title":"Oblivious Computation with Data Locality"
},
{
"authors":"Angelo Massimo Perillo and Emiliano De Cristofaro",
"id":"2017/770",
"title":"PAPEETE: Private, Authorized, and Fast Personal Genomic Testing"
},
{
"authors":"Peter Rindal and Mike Rosulek",
"id":"2017/769",
"title":"Malicious-Secure Private Set Intersection via Dual Execution"
},
{
"authors":"Masahiro Yagisawa",
"id":"2017/763",
"title":"Improved Fully Homomorphic Encryption without Bootstrapping"
},
{
"authors":"Melissa Chase and Ran Gilad-Bachrach and Kim Laine and Kristin Lauter and Peter Rindal",
"id":"2017/762",
"title":"Private Collaborative Neural Network Learning"
},
{
"authors":"Mihaela Ion and Ben Kreuter and Erhan Nergiz and Sarvar Patel and Shobhit Saxena and Karn Seth and David Shanahan and Moti Yung",
"id":"2017/738",
"title":"Private Intersection-Sum Protocol with Applications to Attributing Aggregate Ad Conversions"
},
{
"authors":"Hanyu Quan and Boyang Wang and Iraklis Leontiadis and Ming Li and Yuqing Zhang",
"id":"2017/737",
"title":"SecReach: Secure Reachability Computation on Encrypted Location Check-in Data"
},
{
"authors":"TanPing ZHOU and XiaoYuan YANG and LongFei LIU and Wei ZHANG and YiTao DING",
"id":"2017/735",
"title":"Faster Bootstrapping with Multiple Addends"
},
{
"authors":"Marc Joye",
"id":"2017/732",
"title":"Privacy-Preserving Ridge Regression Without Garbled Circuits"
},
{
"authors":"Ahmad Akmal Aminuddin Mohd Kamal and Keiichi Iwamura",
"id":"2017/718",
"title":"Conditionally Secure Secrecy Computation using Secret Sharing Scheme for n<2k-1 (full paper)"
},
{
"authors":"Le Trieu Phong and Yoshinori Aono and Takuya Hayashi and Lihua Wang and Shiho Moriai",
"id":"2017/715",
"title":"Privacy-Preserving Deep Learning via Additively Homomorphic Encryption"
},
{
"authors":"Irene Giacomelli and Somesh Jha and C. David Page and Kyonghwan Yoon",
"id":"2017/707",
"title":"Privacy-Preserving Ridge Regression on Distributed Data"
},
{
"authors":"Deepesh Data and Manoj Prabhakaran",
"id":"2017/692",
"title":"Towards Characterizing Securely Computable Two-Party Randomized Functions"
},
{
"authors":"Jessica Covington and Megan Golbek and Mike Rosulek",
"id":"2017/687",
"title":"Impossibility of Secure Multi-Party Products in Non-Abelian Groups"
},
{
"authors":"Ruiyu Zhu and Yan Huang",
"id":"2017/683",
"title":"Efficient Privacy-Preserving Edit Distance and Beyond"
},
{
"authors":"Amanda Cristina Davi Resende and Diego F. Aranha",
"id":"2017/677",
"title":"Unbalanced Approximate Private Set Intersection"
},
{
"authors":"Ágnes Kiss and Jian Liu and Thomas Schneider and N. Asokan and Benny Pinkas",
"id":"2017/670",
"title":"Private Set Intersection for Unequal Set Sizes with Mobile Applications"
},
{
"authors":"Michael Raskin",
"id":"2017/665",
"title":"Lower bounds on communication for multiparty computation of multiple «AND» instances with secret sharing"
},
{
"authors":"Morten Dahl and Valerio Pastro and Mathieu Poumeyrol",
"id":"2017/643",
"title":"Private Data Aggregation on a Budget"
},
{
"authors":"Benny Applebaum and Ivan Damgård and Yuval Ishai and Michael Nielsen and Lior Zichron",
"id":"2017/617",
"title":"Secure Arithmetic Computation with Constant Computational Overhead"
},
{
"authors":"Johannes Buchmann and Niklas Büscher and Florian Göpfert and Stefan Katzenbeisser and Juliane Krämer and Daniele Micciancio and Sander Siim and Christine van Vredendaal and Michael Walter",
"id":"2017/606",
"title":"Creating Cryptographic Challenges Using Multi-Party Computation: The LWE Challenge"
},
{
"authors":"Sean Bowe and Ariel Gabizon and Matthew D. Green",
"id":"2017/602",
"title":"A multi-party protocol for constructing the public parameters of the Pinocchio zk-SNARK"
},
{
"authors":"Saikrishna Badrinarayanan and Dakshita Khurana and Amit Sahai",
"id":"2017/597",
"title":"Round Optimal Concurrent MPC via Strong Simulation"
},
{
"authors":"Linru Zhang and Gongxian Zeng and Yuechen Chen and Siu-Ming Yiu and Nairen Cao and Zheli Liu",
"id":"2017/590",
"title":"Constant bandwidth ORAM with small block size using PIR operations"
},
{
"authors":"Daniel S. Roche and Adam J. Aviv and Seung Geol Choi and Travis Mayberry",
"id":"2017/586",
"title":"Deterministic, Stash-Free Write-Only ORAM"
},
{
"authors":"Angela Jäschke and Frederik Armknecht",
"id":"2017/582",
"title":"(Finite) Field Work: Choosing the Best Encoding of Numbers for FHE Computation"
},
{
"authors":"Yihua Zhang and Marina Blanton and Fattaneh Bayatbabolghani",
"id":"2017/569",
"title":"Enforcing Input Correctness via Certification in Garbled Circuit Evaluation"
},
{
"authors":"Ran Canetti and Justin Holmgren and Silas Richelson",
"id":"2017/568",
"title":"Towards Doubly Efficient Private Information Retrieval"
},
{
"authors":"Elette Boyle and Yuval Ishai and Rafael Pass and Mary Wootters",
"id":"2017/567",
"title":"Can We Access a Database Both Locally and Privately?"
},
{
"authors":"Yashvanth Kondi and Arpita Patra",
"id":"2017/561",
"title":"Privacy-Free Garbled Circuits for Formulas: Size Zero and Information-Theoretic"
},
{
"authors":"Fabrice Benhamouda and Hugo Krawczyk and Tal Rabin",
"id":"2017/555",
"title":"Robust Non-Interactive Multiparty Computation Against Constant-Size Collusion"
},
{
"authors":"Yehuda Lindell",
"id":"2017/552",
"title":"Fast Secure Two-Party ECDSA Signing"
},
{
"authors":"Tore Frederiksen and Benny Pinkas and Avishay Yanay",
"id":"2017/550",
"title":"Committed MPC - Maliciously Secure Multiparty Computation from Homomorphic Commitments"
},
{
"authors":"Yarkın Doröz and Jeffrey Hoffstein and Jill Pipher and Joseph H. Silverman and Berk Sunar and William Whyte and Zhenfei Zhang",
"id":"2017/548",
"title":"Fully Homomorphic Encryption from the Finite Field Isomorphism Problem"
},
{
"authors":"Ignacio Cascudo and Ivan Damgård and Oriol Farràs and Samuel Ranellucci",
"id":"2017/545",
"title":"Resource-efficient OT combiners with active security"
},
{
"authors":"Juan Garay and Yuval Ishai and Rafail Ostrovsky and Vassilis Zikas",
"id":"2017/520",
"title":"The Price of Low Communication in Secure Multi-Party Computation"
},
{
"authors":"Nishanth Chandran and Juan Garay and Payman Mohassel and Satyanarayana Vusirikala",
"id":"2017/519",
"title":"Efficient, Constant-Round and Actively Secure MPC: Beyond the Three-Party Case"
},
{
"authors":"Bita Darvish Rouhani and M. Sadegh Riazi and Farinaz Koushanfar",
"id":"2017/502",
"title":"DeepSecure: Scalable Provably-Secure Deep Learning"
},
{
"authors":"Dragos Rotaru and Nigel P. Smart and Martijn Stam",
"id":"2017/496",
"title":"Modes of Operation Suitable for Computing on Encrypted Data"
},
{
"authors":"Marcel Keller and Dragos Rotaru and Nigel P. Smart and Tim Wood",
"id":"2017/492",
"title":"Reducing Communication Channels in MPC"
},
{
"authors":"Chongwon Cho and Nico Döttling and Sanjam Garg and Divya Gupta and Peihan Miao and Antigoni Polychroniadou",
"id":"2017/491",
"title":"Laconic Oblivious Transfer and its Applications"
},
{
"authors":"Sergiu Carpov and Pascal Aubry and Renaud Sirdey",
"id":"2017/483",
"title":"A multi-start heuristic for multiplicative depth minimization of boolean circuits"
},
{
"authors":"Cengiz Orencik and Erkay Savas and Mahmoud Alewiwi",
"id":"2017/472",
"title":"A Unified Framework for Secure Search Over Encrypted Cloud Data"
},
{
"authors":"Jacob Alperin-Sheriff and Jintai Ding and Albrecht Petzoldt and Daniel Smith Tone",
"id":"2017/471",
"title":"Total Break of the Fully Homomorphic Multivariate Encryption Scheme of 2017/458: Decryption can not be of low degree"
},
{
"authors":"Mike Rosulek and Morgan Shirley",
"id":"2017/464",
"title":"On the Structure of Unconditional UC Hybrid Protocols"
},
{
"authors":"Matthew Tamayo-Rios and Jean-Charles Faugère and Ludovic Perret and Peng Hui How and Robin Zhang",
"id":"2017/458",
"title":"Fully Homomorphic Encryption Using Multivariate Polynomials"
},
{
"authors":"Jian Liu and Mika Juuti and Yao Lu and N. Asokan",
"id":"2017/452",
"title":"Oblivious Neural Network Predictions via MiniONN transformations"
},
{
"authors":"Elena Pagnin and Aikaterini Mitrokotsa",
"id":"2017/450",
"title":"Privacy-preserving biometric authentication: challenges and directions"
},
{
"authors":"Abdelrahaman Aly and Mathieu Van Vyve",
"id":"2017/439",
"title":"Practically Efficient Secure Single-Commodity Multi-Market Auctions"
},
{
"authors":"Saikrishna Badrinarayanan and Sanjam Garg and Yuval Ishai and Amit Sahai and Akshay Wadia",
"id":"2017/433",
"title":"Two-Message Witness Indistinguishability and Secure Computation in the Plain Model from New Assumptions"
},
{
"authors":"Ilaria Chillotti and Nicolas Gama and Mariya Georgieva and Malika Izabachène",
"id":"2017/430",
"title":"Improving TFHE: faster packed homomorphic operations and efficient circuit bootstrapping"
},
{
"authors":"Osman Bicer and Muhammed Ali Bingol and Mehmet Sabir Kiraz and Albert Levi",
"id":"2017/415",
"title":"Towards Practical PFE: An Efficient 2-Party Private Function Evaluation Protocol Based on Half Gates"
},
{
"authors":"Satrajit Ghosh and Jesper Buus Nielsen and Tobias Nilges",
"id":"2017/409",
"title":"Maliciously Secure Oblivious Linear Function Evaluation with Constant Overhead"
},
{
"authors":"Peter Rindal and Roberto Trifiletti",
"id":"2017/407",
"title":"SplitCommit: Implementing and Analyzing Homomorphic UC Commitments"
},
{
"authors":"Prabhanjan Ananth and Arka Rai Choudhuri and Abhishek Jain",
"id":"2017/402",
"title":"A New Approach to Round-Optimal Secure Multiparty Computation"
},
{
"authors":"Payman Mohassel and Yupeng Zhang",
"id":"2017/396",
"title":"SecureML: A System for Scalable Privacy-Preserving Machine Learning"
},
{
"authors":"Gilad Asharov and Daniel Demmler and Michael Schapira and Thomas Schneider and Gil Segev and Scott Shenker and Michael Zohner",
"id":"2017/393",
"title":"Privacy-Preserving Interdomain Routing at Internet Scale"
},
{
"authors":"Sébastien Canard and Sergiu Carpov and Donald Nokam Kuate and Renaud Sirdey",
"id":"2017/392",
"title":"Running compression algorithms in the encrypted domain: a case-study on the homomorphic execution of RLE"
},
{
"authors":"Chen Xu and Jingwei Chen and Wenyuan Wu and Yong Feng",
"id":"2017/387",
"title":"Homomorphically Encrypted Arithmetic Operations over the Integer Ring"
},
{
"authors":"Zvika Brakerski and Shai Halevi and Antigoni Polychroniadou",
"id":"2017/386",
"title":"Four Round Secure Computation without Setup"
},
{
"authors":"Benny Applebaum",
"id":"2017/385",
"title":"Garbled Circuits as Randomized Encodings of Functions: a Primer"
},
{
"authors":"Marcel Keller and Emmanuela Orsini and Dragos Rotaru and Peter Scholl and Eduardo Soria-Vazquez and Srinivas Vivek",
"id":"2017/378",
"title":"Faster Secure Multi-Party Computation of AES and DES Using Lookup Tables"
},
{
"authors":"Stefan Wüller and Ulrike Meyer and Susanne Wetzel",
"id":"2017/377",
"title":"Privacy-Preserving Multi-Party Bartering Secure Against Active Adversaries"
},
{
"authors":"Yihua Zhang and Marina Blanton and Fattaneh Bayatbabolghani ",
"id":"2017/369",
"title":"Enforcing Input Correctness via Certification in Garbled Circuit Evaluation"
},
{
"authors":"Vladimir Kolesnikov and Jesper Buus Nielsen and Mike Rosulek and Ni Trieu and Roberto Trifiletti",
"id":"2017/344",
"title":"DUPLO: Unifying Cut-and-Choose for Garbled Circuits"
},
{
"authors":"Irene Giacomelli and Somesh Jha and C. David Page",
"id":"2017/335",
"title":"Privacy-Preserving Linear Regression on Distributed Data"
},
{
"authors":"Charlotte Bonte and Carl Bootland and Joppe W. Bos and Wouter Castryck and Ilia Iliashenko and Frederik Vercauteren",
"id":"2017/333",
"title":"Faster Homomorphic Function Evaluation using Non-Integral Base Encoding"
},
{
"authors":"Matteo Maffei and Giulio Malavolta and Manuel Reinert and Dominique Schröder",
"id":"2017/329",
"title":"Maliciously Secure Multi-Client ORAM"
},
{
"authors":"Manuel Barbosa and Dario Catalano and Dario Fiore",
"id":"2017/326",
"title":"Labeled Homomorphic Encryption: Scalable and Privacy-Preserving Processing of Outsourced Data"
},
{
"authors":"Hao Chen and Kim Laine and Peter Rindal",
"id":"2017/299",
"title":"Fast Private Set Intersection from Homomorphic Encryption"
},
{
"authors":"Jung Hee Cheon and Miran Kim and Yongsoo Song",
"id":"2017/294",
"title":"Secure Searching of Biomarkers Using Hybrid Homomorphic Encryption Scheme"
},
{
"authors":"Okan Seker and Thomas Eisenbarth and Rainer Steinwandt",
"id":"2017/269",
"title":"Extending Glitch-Free Multiparty Protocols to Resist Fault Injection Attacks"
},
{
"authors":"Peter Scholl and Nigel P. Smart and Tim Wood",
"id":"2017/262",
"title":"When It\u0092s All Just Too Much: Outsourcing MPC-Preprocessing"
},
{
"authors":"Aayush Jain and Peter M. R. Rasmussen and Amit Sahai",
"id":"2017/257",
"title":"Threshold Fully Homomorphic Encryption"
},
{
"authors":"João Sá Sousa and Cédric Lefebvre and Zhicong Huang and Jean Louis Raisaro and Carlos Aguilar and Marc-Olivier Killijian and Jean-Pierre Hubaux",
"id":"2017/228",
"title":"Efficient and Secure Outsourcing of Genomic Data Storage"
},
{
"authors":"Ruiyu Zhu and Yan Huang",
"id":"2017/226",
"title":"Faster LEGO-based Secure Computation without Homomorphic Commitments"
},
{
"authors":"Carmit Hazay and Peter Scholl and Eduardo Soria-Vazquez",
"id":"2017/214",
"title":"Low Cost Constant Round MPC Combining BMR and Oblivious-Transfer"
},
{
"authors":"Gizem S Cetin and Hao Chen and Kim Laine and Kristin Lauter and Peter Rindal and Yuhou Xia",
"id":"2017/207",
"title":"Private Queries on Encrypted Genomic Data"
},
{
"authors":"Masahiro Yagisawa",
"id":"2017/198",
"title":"FHE with Recursive Ciphertext "
},
{
"authors":"Jonathan Katz and Samuel Ranellucci and Xiao Wang",
"id":"2017/189",
"title":"Authenticated Garbling and Efficient Maliciously Secure Multi-Party Computation"
},
{
"authors":"Kristian Gjøsteen and Martin Strand",
"id":"2017/166",
"title":"A roadmap to fully homomorphic elections: Stronger security, better verifiability"
},
{
"authors":"Elette Boyle and Niv Gilboa and Yuval Ishai",
"id":"2017/150",
"title":"Group-Based Secure Computation: Optimizing Rounds, Communication, and Computation"
},
{
"authors":"Olivier Sanders and Cristina Onete and Pierre-Alain Fouque",
"id":"2017/148",
"title":"Pattern Matching on Encrypted Streams: Applications to DPI and searches on genomic data"
},
{
"authors":"Amos Beimel and Yuval Ishai and Eyal Kushilevitz",
"id":"2017/147",
"title":"Ad Hoc PSM Protocols: Secure Computation Without Coordination"
},
{
"authors":"Gilad Asharov and Shai Halevi and Yehuda Lindell and Tal Rabin",
"id":"2017/144",
"title":"Privacy-Preserving Search of Similar Patients in Genomic Data"
},
{
"authors":"Xiong Fan and Chaya Ganesh and Vladimir Kolesnikov",
"id":"2017/135",
"title":"Hashing Garbled Circuits for Free"
},
{
"authors":"Payman Mohassel and Mike Rosulek",
"id":"2017/125",
"title":"Non-Interactive Secure 2PC in the Offline/Online and Batch Settings"
},
{
"authors":"Sanjam Garg and Susumu Kiyoshima and Omkant Pandey",
"id":"2017/124",
"title":"On the Exact Round Complexity of Self-Composable Two-Party Computation"
},
{
"authors":"Vanesa Daza and Nikolaos Makriyannis",
"id":"2017/098",
"title":"Designing Fully Secure Protocols for Secure Two-Party Computation of Constant-Domain Functions"
},
{
"authors":"Jung Hee Cheon and Kyoohyung Han and Duhyeong Kim",
"id":"2017/079",
"title":"Faster Bootstrapping of FHE over the Integers"
},
{
"authors":"Carmen Kempka and Ryo Kikuchi and Koutarou Suzuki",
"id":"2017/072",
"title":"How to Circumvent the Two-Ciphertext Lower Bound for Linear Garbling Schemes"
},
{
"authors":"Seiko Arita and Sari Handa",
"id":"2017/066",
"title":"Subring Homomorphic Encryption"
},
{
"authors":"Daniel Benarroch and Zvika Brakerski and Tancrède Lepoint",
"id":"2017/065",
"title":"FHE Over the Integers: Decomposed and Batched in the Post-Quantum Regime"
},
{
"authors":"Arash Afshar and Payman Mohassel and Mike Rosulek",
"id":"2017/062",
"title":"Efficient Maliciously Secure Two Party Computation for Mixed Programs"
},
{
"authors":"Hervé Chabanne and Amaury de Wargny and Jonathan Milgram and Constance Morel and Emmanuel Prouff",
"id":"2017/035",
"title":"Privacy-Preserving Classification on Deep Neural Network"
},
{
"authors":"Yongge Wang and Qutaibah m. Malluhi",
"id":"2017/041",
"title":"Reducing Garbled Circuit Size While Preserving Circuit Gate Privacy"
},
{
"authors":"Jonathan Katz and Samuel Ranellucci and Xiao Wang",
"id":"2017/030",
"title":"Authenticated Garbling and Communication-Efficient, Constant-Round, Secure Two-Party Computation"
},
{
"authors":"Carmit Hazay and Muthuramakrishnan Venkitasubramaniam",
"id":"2017/027",
"title":"Scalable Multi-Party Private Set-Intersection"
},
{
"authors":"Tommaso Gagliardoni and Nikolaos P. Karvelas and Stefan Katzenbeisser",
"id":"2017/014",
"title":"ORAMs in a Quantum World"
},
{
"authors":"Wutichai Chongchitmate and Rafail Ostrovsky",
"id":"2017/010",
"title":"Circuit-Private Multi-Key FHE"
},
{
"authors":"Joshua Gancher and Adam Groce and Alex Ledger",
"id":"2017/008",
"title":"Externally Verifiable Oblivious RAM"
},
{
"authors":"Sungwook Kim and Jinsu Kim and Jae Hong Seo",
"id":"2017/004",
"title":"A New Approach for Practical Function-Private Inner Product Encryption"
},
{
"authors":"P.T. Breuer and J.P. Bowen",
"id":"2016/1191",
"title":"On the Security of Practical and Complete Homomorphic Encrypted Computation"
},
{
"authors":"Sumit Kumar Debnath and Ratna Dutta",
"id":"2016/1180",
"title":"How to Meet Big Data When Private Set Intersection Realizes Constatnt Communication Complexity"
},
{
"authors":"Sumit Chakraborty",
"id":"2016/1167",
"title":"Mobile Commerce: Secure Multi-party Computation & Financial Cryptography"
},
{
"authors":"Ilaria Chillotti and Nicolas Gama and Louis Goubin ",
"id":"2016/1164",
"title":"Attacking FHE-based applications by software fault injections"
},
{
"authors":"Wen-jie Lu and Shohei Kawasaki and Jun Sakuma",
"id":"2016/1163",
"title":"Using Fully Homomorphic Encryption for Statistical Analysis of Categorical, Ordinal and Numerical Data"
},
{
"authors":"Frank Wang and Catherine Yun and Shafi Goldwasser and Vinod Vaikuntanathan and Matei Zaharia",
"id":"2016/1148",
"title":"Splinter: Practical Private Queries on Public Data"
},
{
"authors":"Kartik Nayak and Jonathan Katz",
"id":"2016/1141",
"title":"An Oblivious Parallel RAM with $O(\\log^2 N)$ Parallel Runtime Blowup"
},
{
"authors":"Qiang Tang and Husen Wang",
"id":"2016/1134",
"title":"Privacy-preserving Hybrid Recommender System"
},
{
"authors":"Joppe Bos and Wouter Castryck and Ilia Iliashenko and Frederik Vercauteren",
"id":"2016/1117",
"title":"Privacy-friendly Forecasting for the Smart Grid using Homomorphic Encryption and the Group Method of Data Handling"
},
{
"authors":"T-H. Hubert Chan and Elaine Shi",
"id":"2016/1084",
"title":"Circuit OPRAM: A (Somewhat) Tight Oblivious Parallel RAM"
},
{
"authors":"N. P. Karvelas and Andreas Peter and Stefan Katzenbeisser",
"id":"2016/1077",
"title":"Blurry-ORAM: A Multi-Client Oblivious Storage Architecture"
},
{
"authors":"Jesper Buus Nielsen and Thomas Schneider and Roberto Trifiletti",
"id":"2016/1069",
"title":"Constant Round Maliciously Secure 2PC with Function-independent Preprocessing using LEGO"
},
{
"authors":"Aner Ben-Efraim and Yehuda Lindell and Eran Omri",
"id":"2016/1066",
"title":"Optimizing Semi-Honest Secure Multiparty Computation for the Internet"
},
{
"authors":"Raad Bahmani and Manuel Barbosa and Ferdinand Brasser and Bernardo Portela and Ahmad-Reza Sadeghi and Guillaume Scerri and Bogdan Warinschi",
"id":"2016/1057",
"title":"Secure Multiparty Computation from SGX"
},
{
"authors":"Stanislaw Jarecki",
"id":"2016/1032",
"title":"Efficient Covert Two-Party Computation"
},
{
"authors":"Koji Nuida",
"id":"2016/1040",
"title":"Semi-Honest Secure Multiparty Computation Can Be Insecure with Use of Even Almost Uniformly Random Number Generators"
},
{
"authors":"Brandon Broadnax and Nico Döttling and Gunnar Hartung and Jörn Müller-Quade and Matthias Nagel",
"id":"2016/1043",
"title":"Concurrently Composable Security With Shielded Super-polynomial Simulators"
},
{
"authors":"Anamaria Costache and Nigel P. Smart and Srinivas Vivek",
"id":"2016/1019",
"title":"Faster Homomorphic Evaluation of Discrete Fourier Transforms"
},
{
"authors":"Tobias Nilges",
"id":"2016/1009",
"title":"Efficient Resettably Secure Two-Party Computation"
},
{
"authors":"Ran Cohen and Chris Peikert",
"id":"2016/976",
"title":"On Adaptively Secure Multiparty Computation with a Short CRS"
},
{
"authors":"Marshall Ball and Tal Malkin and Mike Rosulek",
"id":"2016/969",
"title":"Garbling Gadgets for Boolean and Arithmetic Circuits"
},
{
"authors":"Geoffroy Couteau",
"id":"2016/951",
"title":"Revisiting Covert Multiparty Computation"
},
{
"authors":"Foteini Baldimtsi and Dimitrios Papadopoulos and Stavros Papadopoulos and Alessandra Scafuro and Nikos Triandopoulos",
"id":"2016/948",
"title":"Secure Computation in Online Social Networks"
},
{
"authors":"Jun Furukawa and Yehuda Lindell and Ariel Nof and Or Weinstein",
"id":"2016/944",
"title":"High-Throughput Secure Three-Party Computation for Malicious Adversaries and an Honest Majority"
},
{
"authors":"Peeter Laud and Alisa Pankova",
"id":"2016/942",
"title":"Optimizing Secure Computation Programs with Private Conditionals"
},
{
"authors":"Arpita Patra and Pratik Sarkar and Ajith Suresh",
"id":"2016/940",
"title":"Fast Actively Secure OT Extension for Short Secrets"
},
{
"authors":"Michele Orrù and Emmanuela Orsini and Peter Scholl",
"id":"2016/933",
"title":"Actively Secure 1-out-of-N OT Extension with Application to Private Set Intersection"
},
{
"authors":"Benny Pinkas and Thomas Schneider and Michael Zohner",
"id":"2016/930",
"title":"Scalable Private Set Intersection Based on OT Extension"
},
{
"authors":"Peihan Miao",
"id":"2016/907",
"title":"Cut-and-Choose for Garbled RAM"
},
{
"authors":"Jinsheng Zhang and Qiumao Ma and Wensheng Zhang and Daji Qiao",
"id":"2016/882",
"title":"MSKT-ORAM: A Constant Bandwidth ORAM without Homomorphic Encryption"
},
{
"authors":"Nikolaj Volgushev and Malte Schwarzkopf and Andrei Lapets and Mayank Varia and Azer Bestavros",
"id":"2016/883",
"title":"DEMO: Integrating MPC in Big Data Workflows"
},
{
"authors":"Ilaria Chillotti and Nicolas Gama and Mariya Georgieva and Malika Izabachène",
"id":"2016/870",
"title":"Faster Fully Homomorphic Encryption: Bootstrapping in less than 0.1 Seconds"
},
{
"authors":"Jack Doerner and David Evans and abhi shelat",
"id":"2016/861",
"title":"Secure Stable Matching at Scale"
},
{
"authors":"Kartik Nayak and Ling Ren and Ittai Abraham and Benny Pinkas",
"id":"2016/849",
"title":"An Oblivious RAM with Sub-logarithmic Bandwidth Blowup"
},
{
"authors":"Sanjam Garg and Divya Gupta and Peihan Miao and Omkant Pandey",
"id":"2016/815",
"title":"Secure Multiparty RAM Computation in Constant Rounds"
}
]